1
//создайте пустой массив двумя способами
const object = {}

2
//создайте массив со значениями ты, я, мы, они
const arr3 = ['ты', 'я', 'мы', 'они']
arr3[0] = 'ты'
arr3[1] = 'я'
arr3[2] = 'мы'
arr3[3] = 'они'


3
//создайте пустой массив и добавьте ты, я, мы, они с помощью []
const arr4 = []
arr3[0] = 'ты'
arr3[1] = 'я'
arr3[2] = 'мы'
arr3[3] = 'они'

4
//выведите в консоли 'яблоко' из массива
let fruits1 = ['яблоко', 'ананас', 'киви'];
console.log(0);

5
//поменяйте 'ананас' в массиве на 'виноград'
let fruits2 = ['яблоко', 'ананас', 'киви'];
fruits2 [0] = 'виноград'

6
//создайте массив внутри массива с 3мя пустыми обьектами, числом 49 и строкой 'dollar
obj[
    {

    }
    {

    }
    {

    }
    49
    dollar
]

7
//под каким индексом находится 'ананас'?
let fruits3 = ['яблоко', 'ананас', 'киви'];
1

8
//выведите в консоли длину массива с помощью свойства length
let fruits4 = ['яблоко', 'ананас', 'киви'];
console.log(length);

9
//отсортируйте массив ниже с помощью метода
let numbers = [1, 7, 2, 3, 5];
sort

10
//с помощью перебора for...of выведите в консоли каждый фрукт из массива
let fruits5 = ['яблоко', 'ананас', 'киви'];

11
//с помощью перебора forEach выведите в консоли каждый фрукт из массива
let fruits6 = ['яблоко', 'ананас', 'киви'];
fruits6.forEach((b) =>{
    console.log(b);
})

12
//добавьте фрукт манго в конец массива ниже
let fruits7 = ['яблоко', 'ананас', 'киви'];
fruits7.push('Mango')

13
//удалите фрукт киви с конеца массива ниже
let fruits8 = ['яблоко', 'ананас', 'киви'];
delete fruits8 [2]

14
//добавьте фрукт манго в начало массива ниже
let fruits9 = ['яблоко', 'ананас', 'киви'];

15
//удалите фрукт яблоко с начала массива ниже
let fruits10 = ['яблоко', 'ананас', 'киви'];
delete [0]

16
//конвертируйте массив ниже в строку двумя способами
let fruits11 = ['яблоко', 'ананас', 'киви'];

17
//выведите в консоли самый последний элемент массива с помощью свойства length 
let fruits12 = ['яблоко', 'ананас', 'киви', 45];
console.log(length[3]);


18
//вырежте первые два элемента из массива
let fruits13 = ['яблоко', 'ананас', 'киви'];


19
//обедините массивы ниже и отсортируйте
let arr1 = [1, 4, 6];
let arr2 = [3, 5, 7];
arr1.concat(arr2)

20
//создайте копию массива ниже с помощью метода slice
let fruits = ['яблоко', 'ананас', 'киви'];
let newFruits = fruits.slice();
